In [8]:
import pandas as pd
import numpy as np

# Pandas

In [ ]:
"""
<자료구조>
시리즈(Series) : 1차원 배열(열벡터), 배열로부터 생성, 데이터프레임으로부터 생성
                딕셔너리와 유사(인덱스를 key와 유사하게 사용)
                인덱스에 데이터가 매핑
데이터프레임(DataFrame)
"""

## Series

In [4]:
obj = pd.Series([4,5,1,2])
obj

0    4
1    5
2    1
3    2
dtype: int64

In [5]:
obj.values #배열형태로 추출

array([4, 5, 1, 2], dtype=int64)

In [6]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [7]:
obj2 = pd.Series([4,5,1,2], index=['d', 'b', 'a', 'c'])
#series의 데이터 일부를 참조하려할 때 index옵션을 사용하게 됌.
obj2

d    4
b    5
a    1
c    2
dtype: int64

In [10]:
#index를 사용하여 series 값 참조
obj2['a']

1

In [11]:
obj2['d'] = 6
obj2

d    6
b    5
a    1
c    2
dtype: int64

In [12]:
#index 여러개 참조
obj2[['c', 'a', 'd']]

c    2
a    1
d    6
dtype: int64

In [16]:
obj2[obj2>1] #obj>2는 불린

d    6
b    5
c    2
dtype: int64

In [17]:
#벡터화 연산
obj2*2

d    12
b    10
a     2
c     4
dtype: int64

In [19]:
#numpy의 다양한 함수 적용 가능
np.exp(obj2) #2.718...의 obj2지수승 : 2.718...^obj2
np.max(obj2)

6

In [21]:
#인덱스가 있는지 확인 가능
'b' in obj2

True

In [22]:
#value는 있는지 확인 안됌.
2 in obj2

False

딕셔너리 -> 시리즈(Series) 생성

In [ ]:
#딕셔너리 -> 시리즈 생성
cdata = {'Seoul':1000, 'Incheon':200, 'Busan':300, 'Gwangju':100}
cdata2 = ['Suwon', 'Incheon', 'Busan', 'Gwangju']

In [28]:
obj3 = pd.Series(cdata)
print(obj3)

Seoul      1000
Incheon     200
Busan       300
Gwangju     100
dtype: int64

In [31]:
obj3_2 = pd.Series(cdata2)
obj3_2

0      Suwon
1    Incheon
2      Busan
3    Gwangju
dtype: object

In [29]:
obj4 = pd.Series(cdata, index=cdata2) 
#value값은 cdata에서, key(index)값은 cdata2에서 가져옴
#cdata에 없는 key의 값은 NaN으로 처리
#NaN : Pandas에서는 누락값 또는 NA(결측치)라고도 함
#isnull, notnull 함수를 이용하여 누락값을 찾을 수 있음
print(obj4)

Suwon        NaN
Incheon    200.0
Busan      300.0
Gwangju    100.0
dtype: float64

In [34]:
print(pd.isnull(obj4)) #null값이면 True, 데이터가 있으면 False
print(pd.notnull(obj4)) #isnull()과 반대 함수

Suwon       True
Incheon    False
Busan      False
Gwangju    False
dtype: bool
Suwon      False
Incheon     True
Busan       True
Gwangju     True
dtype: bool

Series 결합

In [35]:
print(obj3)
print(obj4)

Seoul      1000
Incheon     200
Busan       300
Gwangju     100
dtype: int64
Suwon        NaN
Incheon    200.0
Busan      300.0
Gwangju    100.0
dtype: float64

In [36]:
obj3+obj4 #Nan이 포함되어 있는 데이터와의 덧셈은 결과값도 무조건 NaN
          #인덱스 자동 정렬(오름차순)

Busan      600.0
Gwangju    200.0
Incheon    400.0
Seoul        NaN
Suwon        NaN
dtype: float64

Series.name

In [38]:
obj4.name = 'population'
obj4

Suwon        NaN
Incheon    200.0
Busan      300.0
Gwangju    100.0
Name: population, dtype: float64

series의 index에 통합 이름 부여(칼럼명)

In [42]:
obj4.index.name = 'city'
obj4

city
Suwon        NaN
Incheon    200.0
Busan      300.0
Gwangju    100.0
Name: population, dtype: float64

In [45]:
print(obj)
obj.index = ['k', 'a', 'j', 'b']
print(obj)

0    4
1    5
2    1
3    2
dtype: int64
k    4
a    5
j    1
b    2
dtype: int64

## DataFrame

: 서로다른 종류의 데이터를 담을 수 있음.(array와의 차이)  
  엑셀 시트 개념과 유사

In [47]:
a = [1,2,3.14,'a'] #요소들이 데이터가 서로 타입이 달라도 한 가지 타입으로 타입변경을 하지 않음
arr = np.array(a) #요소들이 데이터 타입이 다르면 한가지 타입으로 통일
                  #(표현범위가 큰 쪽으로 통일)

print(a)
print(arr)

[1, 2, 3.14, 'a']
['1' '2' '3.14' 'a']

In [95]:
#딕셔너리를 데이터프레임으로 나타내기
data = {'city' : ['Seoul', 'Daegu', 'Busan', "Gwangju"], #열벡터(시리즈)
       'year' : [2000, 2001, 2003, 2002],
       'pop' : [9, 2, 3, 0.1]} #열벡터(시리즈)2
df = pd.DataFrame(data)
df

      city  year  pop
0    Seoul  2000  9.0
1    Daegu  2001  2.0
2    Busan  2003  3.0
3  Gwangju  2002  0.1

In [63]:
print(type(df.city)) #열벡터가 곧 시리즈
df.city #dtype: object => 문자열
#같은 표현 : df['city']

<class 'pandas.core.series.Series'>

0      Seoul
1      Daegu
2      Busan
3    Gwangju
Name: city, dtype: object

In [66]:
print(type(df['year']))
df['year']

<class 'pandas.core.series.Series'>

0    2000
1    2001
2    2003
3    2002
Name: year, dtype: int64

In [68]:
print(type(df['pop']))
df['pop'] #요소의 type은 float
          #표현범위가 큰 float형태로 통일

<class 'pandas.core.series.Series'>

0    9.0
1    2.0
2    3.0
3    0.1
Name: pop, dtype: float64

In [ ]:
"""
int42 = -922경 ~ 922경
float32 = -3.4*(10^38) ~ 3.4*(10^38)
float64 = -1.78*(10^308) ~ 1.78*(10^308)  #표현범위가 가장 넓음
"""

DataFrame Sorting

In [71]:
pd.DataFrame(data)

      city  year  pop
0    Seoul  2000  9.0
1    Daegu  2001  2.0
2    Busan  2003  3.0
3  Gwangju  2002  0.1

In [70]:
#칼럼 순서 변경
pd.DataFrame(data, columns=['year', 'city', 'pop'])

   year     city  pop
0  2000    Seoul  9.0
1  2001    Daegu  2.0
2  2003    Busan  3.0
3  2002  Gwangju  0.1

In [72]:
#칼럼추가
pd.DataFrame(data, columns=['year', 'city', 'pop', 'loc'])

   year     city  pop  loc
0  2000    Seoul  9.0  NaN
1  2001    Daegu  2.0  NaN
2  2003    Busan  3.0  NaN
3  2002  Gwangju  0.1  NaN

In [75]:
#인덱스 이름 지정
df2 = pd.DataFrame(data, columns=['year', 'city', 'pop', 'location'],
            index=['one', 'two', 'three', 'four'])
df2

       year     city  pop location
one    2000    Seoul  9.0      NaN
two    2001    Daegu  2.0      NaN
three  2003    Busan  3.0      NaN
four   2002  Gwangju  0.1      NaN

loc : 행 인덱스 명으로 데이터 검색(추출)  
iloc : 묵시적(고유, 절대적) 행 인덱스 순서로 데이터 검색(추출)

In [80]:
#열 데이터 추출
df2['year']

one      2000
two      2001
three    2003
four     2002
Name: year, dtype: int64

In [83]:
#행 데이터 추출

#loc는 명시적인 인덱스명이 와야 함
print(df2.loc['two']) #'two' 인덱스에 해당되는 데이터들 추출

#iloc는 묵시적인 인덱스 넘버가 와야함
print(df2.iloc[0]) #행 순서의 인덱스(묵시적으로 0번부터 부여된)로 행 데이터 추출

year         2001
city        Daegu
pop             2
location      NaN
Name: two, dtype: object
year         2000
city        Seoul
pop             9
location      NaN
Name: one, dtype: object

In [84]:
df3 = pd.DataFrame(data, columns=['year', 'city', 'pop'],
                  index = [10, 11, 12, 13])
df3

    year     city  pop
10  2000    Seoul  9.0
11  2001    Daegu  2.0
12  2003    Busan  3.0
13  2002  Gwangju  0.1

In [85]:
df3.loc[11] #명시적 인덱스명 [10, 11, 12, 13] 를 이용해 추출해야함. 행라벨로 검색

year     2001
city    Daegu
pop         2
Name: 11, dtype: object

In [86]:
df3.iloc[1] #묵시적 인덱스(0부터 차례로 부여)의 순서로 추출해야함

year     2001
city    Daegu
pop         2
Name: 11, dtype: object

In [87]:
#음수를 사용하여 행 데이터 추출 : iloc만 가능
df3.iloc[-1]

year       2002
city    Gwangju
pop         0.1
Name: 13, dtype: object

데이터프레임 요소 값 변경하기

In [89]:
df2

       year     city  pop location
one    2000    Seoul  9.0      NaN
two    2001    Daegu  2.0      NaN
three  2003    Busan  3.0      NaN
four   2002  Gwangju  0.1      NaN

In [92]:
df2['location'] = 126.0
df2

       year     city  pop  location
one    2000    Seoul  9.0     126.0
two    2001    Daegu  2.0     126.0
three  2003    Busan  3.0     126.0
four   2002  Gwangju  0.1     126.0

In [94]:
df2['location'] = np.arange(4)
df2

       year     city  pop  location
one    2000    Seoul  9.0         0
two    2001    Daegu  2.0         1
three  2003    Busan  3.0         2
four   2002  Gwangju  0.1         3

In [98]:
val = pd.Series([10, 12], index=['one', 'three'])
val

one      10
three    12
dtype: int64

In [105]:
df2['location'] = val #val에 지정되지 않은 값은 NaN(결측값)으로 표시
df2

       year     city  pop  location
one    2000    Seoul  9.0      10.0
two    2001    Daegu  2.0       NaN
three  2003    Busan  3.0      12.0
four   2002  Gwangju  0.1       NaN

In [100]:
df2['location']['one']

10.0

In [108]:
#True(Daegu, Vusan)/ False(Seoul, Gwangju)
df2['eastern'] = (df2.city == 'Daegu') | (df2.city == 'Busan')
df2

       year     city  pop  location  eastern
one    2000    Seoul  9.0      10.0    False
two    2001    Daegu  2.0       NaN     True
three  2003    Busan  3.0      12.0     True
four   2002  Gwangju  0.1       NaN    False

데이터 프레임 칼럼 제거

In [109]:
df2.columns

Index(['year', 'city', 'pop', 'location', 'eastern'], dtype='object')

In [110]:
del df2['eastern']
df2

       year     city  pop  location
one    2000    Seoul  9.0      10.0
two    2001    Daegu  2.0       NaN
three  2003    Busan  3.0      12.0
four   2002  Gwangju  0.1       NaN

중첩 딕셔너리 -> 데이터프레임

In [112]:
pop = {'Jeonju' : [10, 20, 30]}

In [113]:
df4 = pd.DataFrame(pop)
df4

   Jeonju
0      10
1      20
2      30

In [114]:
pop2 = {'Jeonju' : {2001:30, 2002:35},
      'Daejeon' : {2001:80, 2002:90}}

In [116]:
df5= pd.DataFrame(pop2)
df5

      Jeonju  Daejeon
2001      30       80
2002      35       35

In [117]:
df5.T #행과 열을 교환

         2001  2002
Jeonju     30    35
Daejeon    80    35

In [121]:
pop3 = {'Jeonju' : {2001:30, 2002:35},
      'Daejeon' : {1999:80, 2000:90}} #중첩 딕셔너리의 key값이 서로 다를 때

In [122]:
df6= pd.DataFrame(pop3)
df6

      Jeonju  Daejeon
2001    30.0      NaN
2002    35.0      NaN
1999     NaN     80.0
2000     NaN     90.0

In [124]:
df6.index.name = 'year'
df6.columns.name = 'city'
df6

city  Jeonju  Daejeon
year
2001    30.0      NaN
2002    35.0      NaN
1999     NaN     80.0
2000     NaN     90.0

In [125]:
df6.values #데이터프레임의 데이터들을 array로 추출

array([[30., nan],
       [35., nan],
       [nan, 80.],
       [nan, 90.]])

In [132]:
obj = pd.Series(range(11, 14), index=['a', 'b', 'c'])
index = obj.index
# index[0] = 'd' => 에러(assign연산)
index[1:]

b    12
c    13
dtype: int64

#label(레이블 : y)

x입력데이터 -> 모델 -> y출력데이터(예측값, yhat), 실제정답데이터(y,label)
                                         
                                         y==yhat(비교)
    
label(라벨, 인덱스)

In [133]:
labels = pd.Index(np.arange(100, 103))
labels

Int64Index([100, 101, 102], dtype='int64')

In [135]:
obj2 = pd.Series([1.0, -2.0, 0], index=labels)
obj2.index is labels #시리즈의 인덱스와 labels로 선언한 인덱스가 같은지 확인(같은 객체인지?)

True

In [141]:
print(df3.columns)
'city' in df3.columns #'city'컬럼을 포함하는지 확인

Index(['year', 'city', 'pop'], dtype='object')

True

In [140]:
print(df3.index)
11 in df3.index

Int64Index([10, 11, 12, 13], dtype='int64')

True

reindexing(재색인)

In [143]:
obj = pd.Series([4.1, 7.1, -5.5, 3.3], index=['d', 'b', 'a', 'c'])
obj

d    4.1
b    7.1
a   -5.5
c    3.3
dtype: float64

In [144]:
obj2 = obj.reindex(['a', 'b', 'c', 'd'])
obj2

a   -5.5
b    7.1
c    3.3
d    4.1
dtype: float64

In [145]:
obj3 = obj.reindex(['a', 'b', 'c', 'd', 'e'])
obj3 #값이 없는 인덱스를 생성하면 NaN 값이 출력된다.

a   -5.5
b    7.1
c    3.3
d    4.1
e    NaN
dtype: float64

## 시계열 데이터
=> 보간(채움)

예시> 매출데이터  

|날짜|매출|날씨|온도|주문시각
|---|---|---|---|---|
|0803|200|맑음|30|16:00
|0804|50|비|17|10:00
|0805|NaN|맑음|29|16:30

=> 날씨, 온도, 주문시각등을 참고하여 NaN값을 예측하여 결측치를 보간

In [150]:
obj3 = pd.Series(['data1', 'data2', 'data3'], index=[0,2,4])
print(obj3.reindex(range(5)))

print("")

print(obj3.reindex(range(5), method='ffill'))#ffill : forward(위->아래) 방향으로 fill!
print(obj3.reindex(range(5), method='bfill'))#bfill : forward(아래->위)

0    data1
1      NaN
2    data2
3      NaN
4    data3
dtype: object

0    data1
1    data1
2    data2
3    data2
4    data3
dtype: object
0    data1
1    data2
2    data2
3    data3
4    data3
dtype: object

In [158]:
df.loc[[0,2,3],'city']
df.loc[[0,2,3], ['city','pop']]

      city  pop
0    Seoul  9.0
2    Busan  3.0
3  Gwangju  0.1

In [160]:
#행 또는 열 삭제 : drop
obj = pd.Series(np.arange(11, 16), index=['a', 'b', 'c', 'd', 'e'])
obj

a    11
b    12
c    13
d    14
e    15
dtype: int32

In [173]:
#drop함수를 이용한 c행을 삭제
newobj = obj.drop('c')
print(newobj)

newobj2 = obj.drop(['c', 'd']) #동시에 두가지 행 삭제
print(newobj2)

a    11
b    12
d    14
e    15
dtype: int32
a    11
b    12
e    15
dtype: int32

In [183]:
data = pd.DataFrame(np.arange(16).reshape(4,4),
                   index=['Gwangju', 'Seoul', 'Jeju', 'Busan'],
                   columns=['one', 'two', 'three', 'four'])
data

         one  two  three  four
Gwangju    0    1      2     3
Seoul      4    5      6     7
Jeju       8    9     10    11
Busan     12   13     14    15

In [184]:
data.drop(['Seoul', 'Busan'])

         one  two  three  four
Gwangju    0    1      2     3
Jeju       8    9     10    11

In [187]:
print(data.drop(['two'], axis=1)) #axis='colunms'와 같은 뜻
data
 # => 원본 데이터는 그대로 유지

         one  three  four
Gwangju    0      2     3
Seoul      4      6     7
Jeju       8     10    11
Busan     12     14    15

         one  two  three  four
Gwangju    0    1      2     3
Seoul      4    5      6     7
Jeju       8    9     10    11
Busan     12   13     14    15

In [188]:
print(data.drop(['two'], axis=1, inplace=True))
data
# => drop한 값을 반영하여 원래 변수에 적용

None

         one  three  four
Gwangju    0      2     3
Seoul      4      6     7
Jeju       8     10    11
Busan     12     14    15

# 데이터 처리

* DB에서 수행하는 주요 작업 :  
CRUD : Create(생성), Retreive(검색), Update(갱신), Delete(삭제)  
=> 이를 수행하는 명령어 : SQL

## 파일 읽기

In [196]:
df = pd.read_csv("../etc/파일연습/test_csv_file.csv")
df

   ID LAST_NAME  AGE
0   1       KIM   30
1   2      CHOI   25
2   3       LEE   41
3   4      PARK   19
4   5       LIM   36

In [192]:
type(df) #DataFrame

pandas.core.frame.DataFrame

In [200]:
pd.read_csv("../etc/파일연습/test_text_file.txt", sep='|', index_col='ID')
#index_col은 unique한 컬럼을 인덱스로 대신 사용하기 위한 옵션

    A  B  C  D
ID
C1  1  2  3  4
C2  5  6  7  8
C3  1  3  5  7

In [199]:
pd.read_csv("../etc/data/gapminder.tsv", sep="\t") #구분자: tab(\t)

          country continent  year  lifeExp       pop   gdpPercap
0     Afghanistan      Asia  1952   28.801   8425333  779.445314
1     Afghanistan      Asia  1957   30.332   9240934  820.853030
2     Afghanistan      Asia  1962   31.997  10267083  853.100710
3     Afghanistan      Asia  1967   34.020  11537966  836.197138
4     Afghanistan      Asia  1972   36.088  13079460  739.981106
...           ...       ...   ...      ...       ...         ...
1699     Zimbabwe    Africa  1987   62.351   9216418  706.157306
1700     Zimbabwe    Africa  1992   60.377  10704340  693.420786
1701     Zimbabwe    Africa  1997   46.809  11404948  792.449960
1702     Zimbabwe    Africa  2002   39.989  11926563  672.038623
1703     Zimbabwe    Africa  2007   43.487  12311143  469.709298

[1704 rows x 6 columns]

In [205]:
pd.read_csv("../etc/파일연습/text_without_column_name.txt", sep='|',
            header=None, #헤더가 없다는 것을 옵션으로 선언
            names=["ID", "A", "B", "C", "D"], #칼럼이름을 지정
            index_col='ID' #인덱스 대신 고유한 'ID'컬럼을 사용
           )

    A  B  C  D
ID
C1  1  2  3  4
C2  5  6  7  8
C3  1  3  5  7

- 일부 데이터만 추출하기

In [209]:
pd.read_csv("../etc/파일연습/test_csv_file.csv",
            header=None,
            skiprows=3) #원하지 않는 행은 skip함으로써 표에 나타내지 않음(header까지 포함한 rows를 적음)

   0     1   2
0  3   LEE  41
1  4  PARK  19
2  5   LIM  36

In [210]:
#skip[1,2]로 사용해도 같음.
pd.read_csv("../etc/파일연습/test_csv_file.csv",
            skiprows=[1,2])

   ID LAST_NAME  AGE
0   3       LEE   41
1   4      PARK   19
2   5       LIM   36

In [211]:
pd.read_csv("../etc/파일연습/test_csv_file.csv",nrows=3) #위에서부터 3개의 데이터만 읽을 때

   ID LAST_NAME  AGE
0   1       KIM   30
1   2      CHOI   25
2   3       LEE   41

In [215]:
df = pd.read_csv("../etc/파일연습/test_text_file(2).txt", sep='|',
                 index_col='ID', na_values=['모름', '없음', '??'])
#NA는 컴퓨터가 인식하는 결측값이므로 na_values에 이상값의 요소들을 입력
print(df.info())
df

<class 'pandas.core.frame.DataFrame'>
Index: 3 entries, C1 to C3
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       2 non-null      float64
 1   B       2 non-null      float64
 2   C       3 non-null      int64
 3   D       2 non-null      float64
dtypes: float64(3), int64(1)
memory usage: 120.0+ bytes
None

      A    B  C    D
ID
C1  1.0  2.0  3  NaN
C2  NaN  6.0  7  8.0
C3  1.0  NaN  5  7.0